Tekla Open API Reference for Tekla Structures 2025
ComponentItem.GetVersion Method
 Gets the version number of custom component item from the component database.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool GetVersion(
	ref int version
)
Public Function GetVersion (
	ByRef version As Integer
) As Boolean
Parameters
version
Type: System.Int32
The version number of the component item.
Return Value
Type: Boolean
Version number on success, int.MinValue if not found.
See Also
Reference
ComponentItem Class
Tekla.Structures.Catalogs Namespace